<?php

echo strlen("Hello world!"); //شمارش حروف که به اسپیس هم حساس است.
#___________________________
echo str_word_count("Hello world!"); // شمارش کلمات نوع تشخیصش با اسپیس هست
#____________________________
echo strrev("Hello world!"); //برعکس کردن حروف جمله
#____________________________
echo strpos("Hello world!", "world"); // شمارش ایندکس حرف اول کلمه داده شده
#____________________________
echo str_replace("world", "Dolly", "Hello world!"); // جا به جایی کلمه خواسته شده با کلمه مورد نظر
#_____________________________


?>