<?php
// متغیر ها با علامت دلار شروع میشوند
$txt = "Hello world!"; // متغییر عددی که در دابل کوت یا سینگل کوت قرار میگیرد
 $x = 5; //متغیر عددی از نوع اینت
$y = 10.5; //متغیر عددی از نوع فلوت یا اعشار
#__________________________________

$txt = "W3Schools.com";
echo "I love $txt!";

//هر دو متغیر یک خروجی را دارند اما متغیر بالا کد تمیز تری دارد

$txt = "W3Schools.com";
echo "I love " . $txt . "!";

#_________________________________

$x = 5;
$y = 4;
echo $x + $y; // متغیر ها قابلیت جمع و تفریق و عملیات های ریاضی را دارند

#__________________________________



?>
